import React from 'react'
import dynamic from 'next/dynamic'
import { useTranslation } from 'react-i18next'
import { VNTRIP_INFO } from '../../constants/common'

const LayoutCheckout = dynamic(() => import('../../components/layout/LayoutCheckout'))
const HeaderCheckout = dynamic(() => import('../../components/checkout-common/HeaderCheckout'))

const PayFailed = () => {
    const { t } = useTranslation(['common'])
    return (
        <LayoutCheckout>
            <section className="checkoutLayout">
                <HeaderCheckout step={3} type={'hotel'} />
                <div className="checkoutLayout__body">
                    <div className="container">
                        <div className="checkoutState">
                            <div className="checkoutState__cont">
                                <div className="checkoutState__title">
                                    <p className="size-20 semibold mb0 uppercase red-1">
                                        {t('common:THANH TOÁN THẤT BẠI')}!
                                    </p>
                                </div>
                                <div className="checkoutState__text">
                                    <p>
                                        {t(
                                            'common:Rất tiếc Yêu cầu thanh toán của Quý khách trên hệ thống chưa thành công'
                                        )}
                                        .
                                        <br />
                                        {t(
                                            'common:Quý khách vui lòng liên hệ với bộ phận chăm sóc khách hàng để được hỗ trợ ngay'
                                        )}
                                        !
                                    </p>
                                </div>
                                <div className="checkoutState__contact">
                                    <ul>
                                        <li>
                                            <span className="span1">
                                                <svg
                                                    width={14}
                                                    height={14}
                                                    viewBox="0 0 16 16"
                                                    fill="none"
                                                    xmlns="http://www.w3.org/2000/svg"
                                                >
                                                    <path
                                                        fill="#ff8917"
                                                        d="M15.966 12.3978C15.9207 12.2614 15.6328 12.0606 15.1023 11.7956C14.9587 11.7121 14.7539 11.5986 14.489 11.4547C14.2238 11.3107 13.9831 11.178 13.7673 11.0568C13.5511 10.9356 13.3486 10.8182 13.1593 10.7047C13.129 10.682 13.0344 10.6158 12.8753 10.5057C12.716 10.3959 12.5817 10.3144 12.4716 10.2613C12.3618 10.2085 12.2538 10.1819 12.1477 10.1819C11.9962 10.1819 11.807 10.2899 11.5798 10.5057C11.3526 10.7217 11.1442 10.9564 10.9549 11.2104C10.7655 11.4643 10.5647 11.699 10.3528 11.915C10.1406 12.131 9.96622 12.2389 9.83001 12.2389C9.76162 12.2389 9.67637 12.2198 9.57419 12.1822C9.47205 12.1443 9.39436 12.1119 9.34102 12.0858C9.28816 12.059 9.19745 12.0062 9.06857 11.9264C8.93944 11.8468 8.86764 11.8032 8.85251 11.7956C7.81463 11.2197 6.92451 10.5606 6.18197 9.81834C5.43967 9.07569 4.78045 8.18564 4.20469 7.14764C4.19713 7.13248 4.15346 7.06047 4.07397 6.93175C3.99437 6.80291 3.94131 6.71211 3.9148 6.65894C3.88829 6.60596 3.85609 6.52826 3.81828 6.426C3.78046 6.32375 3.76148 6.23857 3.76148 6.17031C3.76148 6.03402 3.86946 5.85968 4.0854 5.64753C4.30129 5.43549 4.53621 5.23464 4.78992 5.04538C5.04383 4.85611 5.27851 4.6477 5.49448 4.4205C5.71038 4.19318 5.81833 4.00388 5.81833 3.85239C5.81833 3.74639 5.79182 3.63832 5.73884 3.52851C5.68582 3.41845 5.60438 3.28415 5.49448 3.12498C5.38455 2.96588 5.31827 2.87127 5.29551 2.84082C5.18199 2.65155 5.06468 2.44891 4.94332 2.23298C4.82196 2.01708 4.6895 1.77643 4.54549 1.5113C4.4016 1.24629 4.28804 1.04166 4.20461 0.897729C3.9396 0.367506 3.73887 0.0794877 3.60246 0.0341913C3.5494 0.0114634 3.4698 0 3.36384 0C3.15917 0 2.89217 0.0378134 2.56263 0.113679C2.23298 0.189425 1.97358 0.268873 1.78415 0.352341C1.40534 0.511356 1.00385 0.973476 0.57954 1.73854C0.193167 2.45055 0 3.15527 0 3.85219C0 4.05658 0.0132546 4.25544 0.0397638 4.4488C0.0662729 4.64197 0.113639 4.85981 0.181902 5.1023C0.250046 5.3447 0.305015 5.52477 0.34657 5.64203C0.388164 5.75938 0.465821 5.96958 0.5795 6.27272C0.69302 6.57579 0.761283 6.76131 0.784011 6.82949C1.04914 7.57199 1.36355 8.23484 1.72716 8.81824C2.3254 9.78793 3.14181 10.7901 4.17591 11.8242C5.21005 12.8583 6.21198 13.6747 7.18176 14.2732C7.76508 14.6368 8.42817 14.9511 9.17054 15.2165C9.23876 15.2391 9.42429 15.3072 9.72723 15.4211C10.0303 15.5347 10.2406 15.6123 10.3579 15.654C10.4753 15.6957 10.6554 15.7507 10.8976 15.819C11.1403 15.8873 11.358 15.9346 11.5512 15.9613C11.7444 15.9875 11.9433 16.001 12.1478 16.001C12.8446 16.001 13.5494 15.8077 14.2615 15.4214C15.0265 14.9972 15.4885 14.5956 15.6476 14.2166C15.7313 14.0273 15.8105 13.7678 15.8863 13.4382C15.9623 13.1087 16 12.8417 16 12.6371C16.0002 12.5307 15.9888 12.4513 15.966 12.3978Z"
                                                    />
                                                </svg>
                                            </span>
                                            <span className="span2">
                                                <strong className="yellow-1">Hotline:&nbsp;</strong>
                                                {VNTRIP_INFO.hotline}
                                            </span>
                                        </li>
                                        <li>
                                            <span className="span1">
                                                <svg
                                                    width={14}
                                                    height={14}
                                                    version="1.1"
                                                    xmlns="http://www.w3.org/2000/svg"
                                                    xmlnsXlink="http://www.w3.org/1999/xlink"
                                                    x="0px"
                                                    y="0px"
                                                    viewBox="0 0 512 512"
                                                    xmlSpace="preserve"
                                                >
                                                    <polygon
                                                        fill="#ff8917"
                                                        points="339.392,258.624 512,367.744 512,144.896 		"
                                                    />
                                                    <polygon
                                                        fill="#ff8917"
                                                        points="0,144.896 0,367.744 172.608,258.624 		"
                                                    />
                                                    <path
                                                        fill="#ff8917"
                                                        d="M480,80H32C16.032,80,3.36,91.904,0.96,107.232L256,275.264l255.04-168.032C508.64,91.904,495.968,80,480,80z"
                                                    />
                                                    <path
                                                        fill="#ff8917"
                                                        d="M310.08,277.952l-45.28,29.824c-2.688,1.76-5.728,2.624-8.8,2.624c-3.072,0-6.112-0.864-8.8-2.624l-45.28-29.856                                                                                      L1.024,404.992C3.488,420.192,16.096,432,32,432h448c15.904,0,28.512-11.808,30.976-27.008L310.08,277.952z"
                                                    />
                                                </svg>
                                            </span>
                                            <span className="span2">
                                                <strong className="yellow-1">Email:&nbsp;</strong>cs@vntrip.vn
                                            </span>
                                        </li>
                                    </ul>
                                </div>
                                <div className="checkoutState__btn">
                                    <a href="/" className="btn btn_orange">
                                        <span>{t('common:Quay về trang chủ')}</span>
                                    </a>
                                </div>
                            </div>
                        </div>
                    </div>
                </div>
            </section>
        </LayoutCheckout>
    )
}

export default PayFailed
